circular-cylinder-2-35/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (1 0 0);
    }

    outlet
    {
        type            freestream;
	freestreamValue	uniform (1 0 0);
    }

    cylinder
    {
	type	rotatingWallVelocity;
	origin	(0 0 0);
	axis	(0 0 1);
	omega	-35;
    }

    top
    {
	type	symmetryPlane;
    }

    bottom
    {
	type	symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}
